# 04 - Grouping

### Step 1. Import the necessary libraries

In [15]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

In [3]:
users.groupby('occupation').agg({'age' : 'mean'})

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [58]:
#users.pivot_table(index = 'occupation', columns = 'gender', aggfunc = sum, margins = True)
# users.pivot_table(index = 'occupation', columns = 'gender', aggfunc = sum)
# sers.groupby(['occupation', 'gender']).count()


absolute_values = users.pivot_table(index = 'occupation', columns = 'gender', aggfunc = 'count', margins = True)["age"]
absolute_values['% Male'] = absolute_values['M'] / absolute_values['All']
absolute_values.sort_values(by = '% Male', ascending = False)

gender             F      M  All    % Male
occupation
doctor           NaN    7.0    7  1.000000
engineer         2.0   65.0   67  0.970149
technician       1.0   26.0   27  0.962963
retired          1.0   13.0   14  0.928571
programmer       6.0   60.0   66  0.909091
executive        3.0   29.0   32  0.906250
scientist        3.0   28.0   31  0.903226
entertainment    2.0   16.0   18  0.888889
lawyer           2.0   10.0   12  0.833333
salesman         3.0    9.0   12  0.750000
educator        26.0   69.0   95  0.726316
All            273.0  670.0  943  0.710498
student         60.0  136.0  196  0.693878
other           36.0   69.0  105  0.657143
marketing       10.0   16.0   26  0.615385
writer          19.0   26.0   45  0.577778
none             4.0    5.0    9  0.555556
administrator   36.0   43.0   79  0.544304
artist          13.0   15.0   28  0.535714
librarian       29.0   22.0   51  0.431373
healthcare      11.0    5.0   16  0.312500
homemaker        6.0    1.0    7  0.142857

### Step 6. For each occupation, calculate the minimum and maximum ages

In [59]:
users.groupby('occupation').agg({'age' : [min, max]})

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [61]:
users.groupby(['occupation', 'gender']).agg({'age' : 'mean'})

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

### Step 8.  For each occupation present the percentage of women and men

In [65]:
absolute_values['%_Female'] = absolute_values['F'] / absolute_values['All']
absolute_values[['% Male', '%_Female']]

gender           % Male  %_Female
occupation
administrator  0.544304  0.455696
artist         0.535714  0.464286
doctor         1.000000       NaN
educator       0.726316  0.273684
engineer       0.970149  0.029851
entertainment  0.888889  0.111111
executive      0.906250  0.093750
healthcare     0.312500  0.687500
homemaker      0.142857  0.857143
lawyer         0.833333  0.166667
librarian      0.431373  0.568627
marketing      0.615385  0.384615
none           0.555556  0.444444
other          0.657143  0.342857
programmer     0.909091  0.090909
retired        0.928571  0.071429
salesman       0.750000  0.250000
scientist      0.903226  0.096774
student        0.693878  0.306122
technician     0.962963  0.037037
writer         0.577778  0.422222
All            0.710498  0.289502